# Core tooling
brew "stow"
brew "git"
brew "curl"

# Shells
brew "zsh"
brew "fish"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Editor
brew "tree-sitter"
brew "neovim"

# CLI utilities
brew "eza"
brew "fzf"
brew "fnm"

# macOS-only GUI apps
if OS.mac?
  cask "wezterm"
  cask "bettertouchtool"
  cask "orbstack"
end
